Repository: SamuelTS/SketchUp-Random-Entity-Generator
Catalog: source/reg/Resources/*/reg.strings
Languages: es, fr

source: Random Entity Generator
es: Generador de Entidades Aleatorias
fr: Générateur d'entités aléatoires

source: Add random entities to your SketchUp models.
es: Añadir entidades aleatorias a tus modelos de SketchUp.
fr: Ajoutez des entités aléatoires à vos modèles SketchUp.

source: Create Enscape proxies.
es: Crear proxys de Enscape.
fr: Créez des proxys Enscape.

source: Randomize position/size of selected entities.
es: Aleatorizar la posición / tamaño de las entidades seleccionadas.
fr: Randomisez la position et la taille des entités sélectionnées.

source: Set as Random Zone...
es: Ajustar como Zona Aleatoria...

source: Randomize...
es: Aleatorizar...
fr: Randomiser...

source: Randomize selected entities
es: Aleatorizar las entidades seleccionadas
fr: Randomiser les entités sélectionnées

source: Randomizing entities... Please wait.
es: Aleatorizando entidades en curso... Espera.
fr: Randomisation des entités en cours... Veuillez patienter.

source: Generate random entities
es: Generar Entidades Aleatorias
fr: Générer des entités aléatoires

source: Generating entities... Please wait.
es: Generando entidades... Espera.
fr: Génération des entités en cours... Veuillez patienter.

source: Explore the Proxy Library...
es: Explorar la biblioteca de proxys...

source: Generate Random Entities...
es: Generar Entidades Aleatorias...
fr: Générer des entités aléatoires...

source: Create a Proxy for Enscape...
es: Crear un Proxy para Enscape...
fr: Créer un proxy pour Enscape...

source: Erase Real Model of Proxy
es: Borrar Modelo Real del Proxy
fr: Effacer le modèle réel du proxy

source: Set Random Zone from Image...
es: Ajustar Zona Aleatoria desde Imagen...

source: Forget the Random Zones
es: Olvidar Zonas Aleatorias
fr: Oublier les zones aléatoires

source: Donate to Plugin Author
es: Donar al Autor del Plugin
fr: Faire un don à l'auteur de l'extension

source: Please select one or many faces.
es: Seleccionar una o más caras.
fr: Veuillez sélectionner une ou plusieurs faces.

source: Set Random Zone
es: Ajustar Zona Aleatoria
fr: Définir la zone aléatoire

source: Defining Random Zone... Please wait.
es: Definiendo Zona Aleatoria... Espera.
fr: Définition d'une zone aléatoire en cours... Veuillez patienter.

source: Entity maximum altitude (m)
es: Altitud máxima de entidades (m)

source: Entity distribution algorithm
es: Algoritmo de distribución des entités

source: Random / Face center
es: Aleatorio / Centro de Caras

source: Random (Slow)
es: Aleatorio (Lento)

source: Face center (Fast)
es: Centro de Caras (Rápido)

source: Surface well added to Random Zone list.
es: Superficie bien añadida a la lista de Zona Aleatoria.
fr: Surface bien ajoutée à la liste des zones aléatoires.

source: Error: Random zone must be constituted of triangles or quad faces.
es: Error: La zona aleatoria debe estar constituida por triángulos o caras cuadrangulares.
fr: Erreur : la zone aléatoire doit être constituée de triangles ou de faces quadrilatérales.

source: Select an Image
es: Seleccionar una Imagen

source: How many centimeters per pixel?
es: ¿Cuantos centímetros por pixel ?

source: How many vertical (Z axis) layers?
es: ¿Cuantas capas verticales (eje Z)?

source: Space between each Z layer (cm)?
es: Espacio entre cada capa Z (cm)

source: Random Zone recorded.
es: Zona Aleatoria grabada.

source: REG Parameters
es: Parámetros de REG
fr: Paramètres de REG

source: Preset
es: Preajuste
fr: Pré-réglage

source: Custom
es: Personalizar

source: Flowers
es: Flores
fr: Fleurs

source: Trees
es: Árboles
fr: Arbres

source: Grass Blocks
es: Bloques de Hierba
fr: Blocs d'herbe

source: Entity count to generate
es: Número de entidades a generar
fr: Nombre d'entités à générer

source: Entity minimum rotation (°)
es: Rotación Mínima Entidad (°)
fr: Rotation minimale des entités (°)

source: Entity maximum rotation (°)
es: Rotación Máxima Entidad (°)
fr: Rotation maximale des entités (°)

source: Entity minimum size
es: Tamaño Mínimo Entidad
fr: Taille minimale des entités

source: Entity maximum size
es: Tamaño Máximo Entidad
fr: Taille maximale des entités

source: Push entities to down (cm)
es: Empujar entidades hacia abajo (cm)
fr: Enfoncer les entités (cm)

source: Entity max. altitude (m)
es: Altitud máxima de entidades (m)
fr: Altitude max. des entités (m)

source: Entity density
es: Densidad de Entidades
fr: Densité des entités

source: Glue entities to ground?
es: ¿Pegar las entidades al suelo?
fr: Coller les entités au sol ?

source: Follow face normals?
es: ¿Seguir las normales de la cara?
fr: Suivre les normales des faces ?

source: Avoid entity collision?
es: ¿Evitar colisiones de entidades?
fr: Éviter les collisions d'entités ?

source: Overwrite entity colors?
es: ¿Sobrescribir los colores de las entidades?
fr: Écraser les couleurs des entités ?

source: Put entities in group
es: Colocar las entidades en el grupo

source: Put entities in layer
es: Colocar las entidades en la capa

source: Yes
es: Sí
fr: Oui

source: This parameter is disabled because no random zone is defined.
es: Este parámetro está desactivado porque no hay una zona aleatoria definida.
fr: Ce paramètre est désactivé car aucune zone aléatoire n'est définie.

source: This parameter is disabled because a random zone is defined.
es: Este parámetro está desactivado porque hay una zona aleatoria definida.
fr: Ce paramètre est désactivé car une zone aléatoire est définie.

source: Preview
es: Previsualizar
fr: Prévisualiser

source: Image must be a maximum of 1024 x 1024 pixels.
es: La imagen debe tener un máximo de 1024 x 1024 píxeles.

source: REG Proxy Library Explorer
es: Explorador de la Biblioteca de proxys REG
fr: Explorateur de la bibliothèque de proxys REG

source: Select a SketchUp Model
es: Seleccionar un Modelo SketchUp
fr: Sélectionnez un modèle SketchUp

source: SketchUp Models
es: Modelos SketchUp
fr: Modèles SketchUp

source: Create an Enscape proxy
es: Crear un proxy Enscape
fr: Créer un proxy Enscape

source: To optimize SketchUp model weight, run: Erase Real Model of Proxy.
es: Para optimizar el peso del modelo SketchUp, ejecutar: Eliminar el Modelo Real de Proxy.
fr: Pour optimiser le poids du modèle SketchUp, lancez : Effacer le modèle réel du proxy.

source: Alaska Cedar
es: Cedro de Alaska
fr: Cèdre d'Alaska

source: Bolete
es: Seta
fr: Bolet

source: Conifer
es: Conífera
fr: Conifère

source: European Birch
es: Abedul Europeo
fr: Bouleau européen

source: Grass Block
es: Bloque de Hierba
fr: Bloc d'herbe

source: Pink Daisy Flower
es: Margarita Rosa
fr: Marguerite rose

source: Plane
es: Arbol de Plátano
fr: Platane

source: White Daisy Flower
es: Margarita Blanca
fr: Marguerite blanche

source: Import this model as Enscape proxy.
es: Importar este modelo como proxy Enscape.
fr: Importer ce modèle en tant que proxy Enscape.

source: Import this model as V-Ray proxy.
es: Importar este modelo como proxy V-Ray.
fr: Importer ce modèle en tant que proxy V-Ray.

source: Set as Random Zone
fr: Définir en tant que zone aléatoire

source: Explore Proxy Library...
fr: Explorer la bibliothèque de proxys...

source: No
fr: Non

source: Azalea
fr: Azalée
